Revit 2026 API

# PathReinforcementIsValidRebarShapeId Method

---

Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidRebarShapeId(
	Document aDoc,
	ElementId elementId
)
```
```vb
Public Shared Function IsValidRebarShapeId (
	aDoc As Document,
	elementId As ElementId
) As Boolean
```
```cpp
public:
static bool IsValidRebarShapeId(
	Document^ aDoc,
	ElementId^ elementId
)
```
```fsharp
static member IsValidRebarShapeId :
        aDoc : Document *
        elementId : ElementId -> bool
```

#### Parameters

aDoc Document
     The document.
elementId ElementId
     An element id.

#### Return Value

Boolean True if the specified element id corresponds to a Rebar Shape element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The Rebar Shape has to be two dimensional shape only and its neighbouring segments may form only right angles. Rebar Shapes that have end treatments or crank ar not allowed.

#### Reference

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace